In [1]:
# pandas 
# Series : 행x 값 데이터
# 1차원 데이터를 잘 표현하기 위해 만든 Series
# 데이터 배열에 이름과 각 데이터의 라벨를 붙임
import pandas as pd

In [3]:
my_series=pd.Series([58400,59200,59000,60400,61000,61000,59500,59300],index=['2022-09-09','2022-09-10','2022-09-11','2022-09-14','2022-09-15','2022-09-16','2022-09-17','2022-09-18'])

In [4]:
my_series

2022-09-09    58400
2022-09-10    59200
2022-09-11    59000
2022-09-14    60400
2022-09-15    61000
2022-09-16    61000
2022-09-17    59500
2022-09-18    59300
dtype: int64

In [5]:
my_series.index

Index(['2022-09-09', '2022-09-10', '2022-09-11', '2022-09-14', '2022-09-15',
       '2022-09-16', '2022-09-17', '2022-09-18'],
      dtype='object')

In [9]:
my_series.name='A005930'

In [10]:
my_series

2022-09-09    58400
2022-09-10    59200
2022-09-11    59000
2022-09-14    60400
2022-09-15    61000
2022-09-16    61000
2022-09-17    59500
2022-09-18    59300
Name: A005930, dtype: int64

In [12]:
my_series.name

'A005930'

In [13]:
# Series 접근, 연산, 생성
# Series 에서 indexing, Slicing 하기
# .loc 은 Series에서 인덱스를 이용하여 일부 추출
# .iloc 은 Series 에서 배열 번호를 이용하여 일부 추출
my_series.loc['2022-09-09']

58400

In [14]:
my_series.iloc[3]

60400

In [15]:
my_series.loc['2022-09-09':'2022-09-14']

2022-09-09    58400
2022-09-10    59200
2022-09-11    59000
2022-09-14    60400
Name: A005930, dtype: int64

In [17]:
my_series.iloc[3:5] # 배열 번호로 Slicing(끝 포함 x)

2022-09-14    60400
2022-09-15    61000
Name: A005930, dtype: int64

In [18]:
#Series 에서 연산하기 (Broadcasting, Aggrzegation)

my_series.iloc[4:]+my_series.iloc[4:]

2022-09-15    122000
2022-09-16    122000
2022-09-17    119000
2022-09-18    118600
Name: A005930, dtype: int64

In [19]:
my_series.iloc[4:]+30000

2022-09-15    91000
2022-09-16    91000
2022-09-17    89500
2022-09-18    89300
Name: A005930, dtype: int64

In [20]:
my_series.iloc[4:].mean()

60200.0

In [23]:
# Series 생성
new_sr=pd.Series([11,12,13,14],name='apple',
                 index=['a','b','xs','e11'])
new_sr

a      11
b      12
xs     13
e11    14
Name: apple, dtype: int64

In [26]:
#DataFrame 행x열
# 2차원 데이터를 잘 다루기 위해 만든 DataFrame
# 여러 개의 Series를 묶어서 만든 형태
# 각각 Series의 name은 DataFrame에서는 열이 됨
import numpy as np

df = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20190102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df

     A          B    C  D      E    F
0  1.0 2019-01-02  1.0  3   test  foo
1  1.0 2019-01-02  1.0  3  train  foo
2  1.0 2019-01-02  1.0  3   test  foo
3  1.0 2019-01-02  1.0  3  train  foo

In [27]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [28]:
df.index=['2022-09-12','2022-09-13','2022-09-14','2022-09-15']

In [32]:
df.loc['2022-09-12':'2022-09-14','A':'B']

              A          B
2022-09-12  1.0 2019-01-02
2022-09-13  1.0 2019-01-02
2022-09-14  1.0 2019-01-02

In [30]:
df.loc['2022-09-12':'2022-09-14']

              A          B    C  D      E    F
2022-09-12  1.0 2019-01-02  1.0  3   test  foo
2022-09-13  1.0 2019-01-02  1.0  3  train  foo
2022-09-14  1.0 2019-01-02  1.0  3   test  foo

In [31]:
# [인덱스slice, 컬럼이름]으로 접근 -> Series 반환
df.loc['2022-09-13':'2022-09-15','A']

2022-09-13    1.0
2022-09-14    1.0
2022-09-15    1.0
Name: A, dtype: float64

In [34]:
# ilic[index, column slice] 으로 접근 -> Series 반환
df.iloc[0,3:]

D       3
E    test
F     foo
Name: 2022-09-12, dtype: object

In [35]:
df.iloc[1:3,1:4]

                    B    C  D
2022-09-13 2019-01-02  1.0  3
2022-09-14 2019-01-02  1.0  3

In [36]:
# 접근,연산
# :: 으로 모든 원소 지칭
df.loc[::,'A']

2022-09-12    1.0
2022-09-13    1.0
2022-09-14    1.0
2022-09-15    1.0
Name: A, dtype: float64

In [39]:
# : 한번만 사용 가능
df.iloc[2,:]

A                    1.0
B    2019-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2022-09-14, dtype: object

In [41]:
df.iloc[2,:].shape

(6,)

In [42]:
df.iloc[2:,::3] # 간격 3

              A  D
2022-09-14  1.0  3
2022-09-15  1.0  3

In [43]:
df.iloc[2:,::3].shape

(2, 2)

In [44]:
df2=df.loc[:'2022-09-13','B':]
df2

                    B    C  D      E    F
2022-09-12 2019-01-02  1.0  3   test  foo
2022-09-13 2019-01-02  1.0  3  train  foo

In [ ]:
# 모두 숫자 데이터일 때 컬럼별로 평균낼수 있음
df.mean(axis=0)

In [ ]:
# 정렬
''' 
1. 단일연산
.abs() : 절댓값
.isna() : na 여부
.notna() : 유효 여부
.pow() : 거듭제곱

2. 축 방향 연산( axis=0 or 1)
.mean() : 평균
.median()  : 중앙값
.max() : 최댓값
.min() : 최솟값
.sum() : 더하기
.prod() : 곱하기
.idxmax() : 최대원소의 인덱스
.idxmin() : 최소원소 인덱스

3. 누적 축 방향 연산 (axis=0 or 1)
.cummax() : 누적 최댓값
.cummin() : 누적 최솟값
.cumprod() : 누적곱셈
.cumsum() : 누적덧셈

'''

In [47]:
df.notna()

               A     B     C     D     E     F
2022-09-12  True  True  True  True  True  True
2022-09-13  True  True  True  True  True  True
2022-09-14  True  True  True  True  True  True
2022-09-15  True  True  True  True  True  True

In [50]:
df3 = {
    '학번' : range(2000, 2010)
    , '성적' : [85, 95, 75, 70, 100, 100, 95, 85, 80, 85]
}
df3=pd.DataFrame(df3)

In [51]:
df3

     학번   성적
0  2000   85
1  2001   95
2  2002   75
3  2003   70
4  2004  100
5  2005  100
6  2006   95
7  2007   85
8  2008   80
9  2009   85

In [53]:
df3.notna()

     학번    성적
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True
5  True  True
6  True  True
7  True  True
8  True  True
9  True  True

In [54]:
df3.sum(axis=0)

학번    20045
성적      870
dtype: int64

In [55]:
df3.sum(axis=1)

0    2085
1    2096
2    2077
3    2073
4    2104
5    2105
6    2101
7    2092
8    2088
9    2094
dtype: int64

In [57]:
df3.median(axis=0)

학번    2004.5
성적      85.0
dtype: float64

In [58]:
df3.cumsum(axis=0)

      학번   성적
0   2000   85
1   4001  180
2   6003  255
3   8006  325
4  10010  425
5  12015  525
6  14021  620
7  16028  705
8  18036  785
9  20045  870

In [66]:
# 정렬기준의 행 또는 열 값들을 기준으로 axis 방향 정렬을 수행
# axis: 정렬할 축, 0또는 index는 행을 정렬, 1 또는 columns 열을 정렬
# ascending : 오름차순 여부를 지정함, 기본 값은 True,False는 내림차순
# rank: 축 방향으로 정렬, 각각의 행 또는 열들의 순위를 매김. 축과 오름차순 여부 지정 가능
# 같은 값의 경우, 순위의 평균

df3.rank(axis=0,ascending=True)

     학번   성적
0   1.0  5.0
1   2.0  7.5
2   3.0  2.0
3   4.0  1.0
4   5.0  9.5
5   6.0  9.5
6   7.0  7.5
7   8.0  5.0
8   9.0  3.0
9  10.0  5.0

In [70]:
# DataFrame 만들기, 행 추가, 열 추가

data=pd.DataFrame([[0,1,2],[3,4,5]],
             index=['00','11'],
             columns=['a','b','c'])

In [71]:
data

    a  b  c
00  0  1  2
11  3  4  5

In [72]:
pd.DataFrame(np.ones((3,5)))

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0

In [73]:
trafic_data=pd.DataFrame(
    [[9800,5500],[10200,6600]],
    index=['10.22','10.23'],
    columns=['원티드','사람인']
)

trafic_data

         원티드   사람인
10.22   9800  5500
10.23  10200  6600

In [74]:
# 새로운 열 추가하기
trafic_data.loc[:,'잡플래닛']=np.nan
trafic_data

         원티드   사람인  잡플래닛
10.22   9800  5500   NaN
10.23  10200  6600   NaN

In [75]:
trafic_data.loc[:,'스펙업']=20000
trafic_data

         원티드   사람인  잡플래닛    스펙업
10.22   9800  5500   NaN  20000
10.23  10200  6600   NaN  20000

In [76]:
# 새로운 행 추가 -> .loc[]
trafic_data.loc['10.25']=[12000,3450,4000,23432]

In [77]:
trafic_data

         원티드   사람인    잡플래닛    스펙업
10.22   9800  5500     NaN  20000
10.23  10200  6600     NaN  20000
10.25  12000  3450  4000.0  23432

In [78]:
# 하나의 값만 지정하면 broadcast 된다
trafic_data.loc['10.26']=2000
trafic_data

         원티드   사람인    잡플래닛    스펙업
10.22   9800  5500     NaN  20000
10.23  10200  6600     NaN  20000
10.25  12000  3450  4000.0  23432
10.26   2000  2000  2000.0   2000

In [ ]:
# 데이터 파일 불러오기
pd.read_csv('파일명.csv')

# csv파일로 저장하기
# 한글이 포함된 경우, 엑셀을 위해 인코딩 지정
df.to_csv('파일명.csv',encoding='cp949')